notes/virt_manager.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>virt-manager</title>
<meta name="generator" content="Org Mode" />
<link rel="icon" type="base/favicon" href="/base/favicon.png">
<link rel="stylesheet" href="https://www.haider.gq/base/style.css"/>
<link rel="stylesheet" href="https://www.haider.gq/base/table.css"/>
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.7.0/css/font-awesome.min.css" />
<link href="https://fonts.googleapis.com/css2?family=Roboto+Slab:wght@600&display=swap" rel="stylesheet">
</head>
<body>
<div id="preamble" class="status">
<header>
	  <a href='https://www.haider.gq' class='main_header'>Haider Mirza</a>
	  <nav>
	    <ul class='nav_links'>
	      <li><a href='https://www.haider.gq/projects/projects'>Projects</a></li>
	      <li><a href='https://www.haider.gq/blogs/blogs'>Blogs</a></li>
	      <li><a href='https://www.haider.gq/repos/repos'>Repositories</a></li>
	      <li><a href='https://www.haider.gq/notes'>Notes</a></li>
	    </ul>
	  </nav>
	</header>
</div>
<div id="content" class="content">
<h1 class="title">virt-manager</h1>
<div id="outline-container-org9262461" class="outline-2">
<h2 id="org9262461">virt-manager</h2>
<div class="outline-text-2" id="text-org9262461">
<p>
The virtual machine manager that uses QEMU and KVM.
</p>
</div>
<div id="outline-container-org1ed123c" class="outline-3">
<h3 id="org1ed123c">How to exit fullscreen</h3>
<div class="outline-text-3" id="text-org1ed123c">
<p>
Ctrl-Alt to release cursor.
</p>
</div>
</div>
<div id="outline-container-org82e6282" class="outline-3">
<h3 id="org82e6282">Mouse &amp; Keyboard passthrough</h3>
<div class="outline-text-3" id="text-org82e6282">
<p>
Here is a blog post on the matter: <a target='_blank' rel='noopener noreferrer' class='external' href="https://passthroughpo.st/using-evdev-passthrough-seamless-vm-input/">Evdev</a>
Here is the commands I used
</p>
<div class="org-src-container">
<pre class="src src-shell">sudo chgrp kvm /dev/input/by-id/usb-MOSART_Semi._2.4G_Keyboard_Mouse-if01-event-mouse
sudo chgrp kvm /dev/input/by-id/usb-MOSART_Semi._2.4G_Keyboard_Mouse-event-kbd
</pre>
</div>
</div>
</div>
<div id="outline-container-orgab90820" class="outline-3">
<h3 id="orgab90820">Bugs/Errors</h3>
<div class="outline-text-3" id="text-orgab90820">
</div>
<div id="outline-container-orga0dd011" class="outline-4">
<h4 id="orga0dd011">Mouse &amp; Keyboard passthrough permission error</h4>
<div class="outline-text-4" id="text-orga0dd011">
<p>
You may have it that virt-manager does not have permissions to use a usb device.
Here is an article that shows my exact issue: <a target='_blank' rel='noopener noreferrer' class='external' href="https://unix.stackexchange.com/questions/694169/how-to-make-a-usb-device-available-to-a-qemu-guest">https://unix.stackexchange.com/questions/694169/how-to-make-a-usb-device-available-to-a-qemu-guest</a>
Here is the commands I run:
</p>

<div class="org-src-container">
<pre class="src src-shell">$ lsusb
 Bus 001 Device 004: ID 17ef:600e Lenovo Optical Mouse

$ sudo chgrp kvm /dev/bus/usb/001/004
$ <span style="font-weight: bold; font-style: italic;">LC_ALL</span>=C ls -l /dev/bus/usb/001/002
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org566fe1a" class="outline-2">
<h2 id="org566fe1a">Links to this note</h2>
<div class="outline-text-2" id="text-org566fe1a">
<ul class="org-ul">
<li><a href="./programs.html">Programs</a></li>
<li><a href="./guix.html">Guix</a></li>
<li><a href="./programs.html">Programs</a></li>
<li><a href="./guix.html">Guix</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer>
	  <div class='footer-content'>
	    <h3>Haider Mirza</h3>
	    <p>Website created by Haider Mirza</p>
	    <ul class='socials'>
	      <li><a href='https://www.github.com/Haider-Mirza'><i class='fa fa-github'></i></a></li>
	      <li><a href='mailto:haider@haider.gq'><i class='fa fa-envelope'></i></a></li>
	    </ul>
	  </div>
	  <div class='footer-bottom'>
	    <p>Created by Haider Mirza with orgmode in emacs</p>
	  </div>
	</footer>
</div>
</body>
</html>
